### Agenda: 


   **df['new_col']** - Adding new series to the dataframe

In [1]:
import pandas as pd

In [2]:
#Define Column Names

col_names = ['ID', 'Age', 'Gender', 'Occupation', 'Revenue']

In [3]:
movie_viewers = pd.read_table('Resources/u.user', sep='|', header=None, names=col_names)
movie_viewers.head()

   ID  Age Gender  Occupation Revenue
0   1   24      M  technician   85711
1   2   53      F       other   94043
2   3   23      M      writer   32067
3   4   24      M  technician   43537
4   5   33      F       other   15213

---

#### Add New Column

> #### Invalid Series Add

In [4]:
#Invalid add operation. Only allow attribute access but not creation

movie_viewers.new = movie_viewers.Gender + movie_viewers.Occupation

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  This is separate from the ipykernel package so we can avoid doing imports until

In [5]:
movie_viewers.head()

   ID  Age Gender  Occupation Revenue
0   1   24      M  technician   85711
1   2   53      F       other   94043
2   3   23      M      writer   32067
3   4   24      M  technician   43537
4   5   33      F       other   15213

> #### Valid Series Add

In [6]:
#Invalid add operation. Only allow attribute access but not creation

movie_viewers['new'] = movie_viewers.Gender + movie_viewers.Occupation

In [7]:
movie_viewers.head()

   ID  Age Gender  Occupation Revenue          new
0   1   24      M  technician   85711  Mtechnician
1   2   53      F       other   94043       Fother
2   3   23      M      writer   32067      Mwriter
3   4   24      M  technician   43537  Mtechnician
4   5   33      F       other   15213       Fother